#+title: DBScan Embedded Improvements
#+setupfile: ~/jacksonmowry.github.io/jake.setup
#+options: toc:nil \n:t
#+bibliography: exploring_iouring.bib

* SWAR Exploration
#+begin_src C :results verbatim
#include <stdio.h>
#include <stdint.h>

uint8_t neuron_charges[8] = {1,2,3,4,5,6,7,8};
uint8_t neuron_thresholds[8] = {1,62,3,5,5,7,7,8};
uint8_t results[8]={0};

uint64_t vec_a = *(uint64_t*)neuron_charges | 0x8080808080808080;
uint64_t vec_b = *(uint64_t*)neuron_thresholds;

uint64_t vec_result = (vec_a - vec_b) & 0x7f7f7f7f7f7f7f7f;
uint64_t mask = (vec_result & 0x6060606060606060) << 1;
vec_result |= mask;

*(uint64_t*)results = vec_result;

for (int i = 0; i < 8; i++) {
    int8_t tmp = results[i];
    printf("%2d - %2d = %3d\n", neuron_charges[i], neuron_thresholds[i], tmp);
}
#+end_src

#+RESULTS:
: 1 -  1 =   0
: 2 - 62 = -60
: 3 -  3 =   0
: 4 -  5 =  -1
: 5 -  5 =   0
: 6 -  7 =  -1
: 7 -  7 =   0
: 8 -  8 =   0
